<head>
<title>Laurent Moss</title>
<script type="text/javascript">
function protectEmail(nom, domain, sep) {
		document.write('<a class="wiki" href="mailto:'+nom+'@'+domain+'">'+nom+sep+domain+'</a>');
}
</script>

<style type="text/css">
body {
	font-family: Verdana, Arial, sans-serif;
}

h1 {
	text-align: center;
}

th {
	background-color: black;
	color: white;
}

td {
	line-height: 1.25em;
}

ul {
	margin-left: 1em;
}

a {
	text-decoration: none;
}
</style>
</head>

<body>

<table border="0" width="100%">
   <tr>
     <td width="50%">
       <p align="center"><a href="http://www.spacecodesign.com/" target="_blank"><img border="0" src="images/logo_space.jpg" 
alt="Space Codesign" width="268" height="135"></a></td>
     <td width="50%">
       <p align="center"><a href="http://www.polymtl.ca/" target="_blank"><img border="0" src="images/logo_poly.gif" 
alt="&Eacute;cole Polytechnique de Montr&eacute;al" width="175" height="75"></a></td>
   </tr>
</table>

<h1>Laurent Moss, ing.</h1>

<table border="0" width="100%" cellspacing="10">
<tr>
<th>Profil</th>
</tr>

<tr><td>

<table border="0" width="100%"><tr><td><img src="LaurentMoss.jpg"></td><td>&nbsp;</td>
<td>
<p>
<b>Nom: </b>Laurent Moss<br>
<b>Dipl&ocirc;mes: </b>B.Ing. (2005), M.Sc.A. (2008) et Ph.D. (2010) en g&eacute;nie informatique de l&apos;&Eacute;cole Polytechnique de Montr&eacute;al<br>
<b>Th&egrave;se de doctorat: </b>Profilage, caract&eacute;risation et partitionnement fonctionnel dans une plate-forme de conception de syst&egrave;mes embarqu&eacute;s<br>
<b>Directeur de recherche: </b><a target="_blank" href="http://www.grm.polymtl.ca/~bois/">Guy Bois</a><br>
<b>Co-directeur:</b> <a href="http://www.iro.umontreal.ca/~aboulham/" target="_blank">El Mostapha Aboulhamid</a><br>
<b>Courrier &eacute;lectronique: </b><script language="Javascript" type="text/javascript">protectEmail('moss', 'grm.polymtl.ca', '@');</script><noscript>moss &agrave; grm.polymtl.ca</noscript><br>
       <b>Institution: </b><a target="_blank" href="http://www.polymtl.ca/">&Eacute;cole
       Polytechnique de Montr&eacute;al</a><br>
       <b>Groupes de travail: </b><a href="http://www.grm.polymtl.ca/" target="_blank">Groupe de Recherche en Micro&eacute;lectronique</a>, 
      <a href="http://www.spacecodesign.com/" target="_blank">Space Codesign</a>
</td></tr></table>

</td></tr>
<tr>
<th>Publications</th>
</tr>

<tr><td>
<p><b>MOSS Laurent</b>, GU&Eacute;RARD Hubert, DARE Gary, BOIS Guy. <a href="http://dx.doi.org/10.4271/2012-01-2133"><u>An ESL Methodology for Rapid Creation of Embedded Aerospace Systems using Hardware-Software Co-Design on Virtual Platforms</u></a>. 1st SAE 2012 Aerospace Electronics and Avionics Systems Conference (AEAS&apos;12), octobre 2012, 10 p.
<p><b>MOSS Laurent</b>, GU&Eacute;RARD Hubert, DARE Gary, BOIS Guy. <a href="http://www.same-conference.org/images/documents/papers/2012/paper-s5-1715.pdf"><u>Recent Experience on an ESL Framework for Rapid Design Exploration using Hardware-Software Codesign for ARM based FPGAs</u></a>. 15th Sophia Antipolis Microelectronics Conference (SAME&apos;12), octobre 2012, 6 p.
<p>POLLINA Marc, LECLERC Yann, CONQUET Eric, PERROTIN Maxime, BOIS Guy, <b>MOSS Laurent</b>. <a href="http://www.erts2012.org/Site/0P2RUC89/4A-3.pdf"><u>The ASSERT Set of Tools for Engineering (TASTE): Demonstrator, HW/SW Codesign and Future Evolution</u></a>. 6th International Congress &amp; Exhibition on Embedded Real Time Software and Systems (ERTS2&apos;12), f&eacute;vrier 2012, 10 p.
<p>BOIS Guy, <b>MOSS Laurent</b>, POLLINA Marc, LECLERC Yann. <a href="http://microelectronics.esa.int/core/eslday_2011/8_SpaceStudio_SpaceCodesign.pdf"><u>Extending TASTE through integration with SpaceStudio</u></a>. European Space Agency&apos;s 1st Electronic System-Level Day, septembre 2011.
<p>POLLINA Marc, LECLERC Yann, CONQUET Eric, BOIS Guy, <b>MOSS Laurent</b>. <u>The ASSERT Set of Tools for Engineering (TASTE): Current Features, Demonstrator and Future Evolution</u>. International Space System Engineering Conference, Data Systems In Aerospace (DASIA&apos;11), mai 2011, 5 p.
<p>LE BEUX S&eacute;bastien, <b>MOSS Laurent</b>, MARQUET Philippe, DEKEYSER Jean-Luc. "A High Level Synthesis Flow Using Model Driven Engineering," in <a href="http://www.amazon.ca/exec/obidos/ASIN/9048199646/leblogdepolys-20"><u>Algorithm-Architecture Matching for Signal and Image Processing</u></a>, GOGNIAT Guy, MILOJEVIC Dragomir et MORAWIEC Adam &Eacute;ds. New York, NY: Springer, 2010, pp. 253-274.
<p>ROGERS-VALL&Eacute;E Michel, CANTIN Marc-Andr&eacute;, <b>MOSS Laurent</b>, BOIS Guy. <a href="http://dx.doi.org/10.1109/ICCD.2010.5647622"><u>IP Characterization Methodology for Fast and Accurate Power Consumption Estimation at Transactional Level Model</u></a>. 28th IEEE International Conference on Computer Design (ICCD&apos;10), octobre 2010, pp. 534-541.
<p>BOIS Guy, <b>MOSS Laurent</b>, ABOULHAMID Mostapha. <u>Fast and accurate estimation for automatic design space exploration of MPSoC systems</u>. 10th International Forum on Embedded MPSoC and Multicore (MPSoC&apos;10), juin 2010.
<p>BOIS Guy, <b>MOSS Laurent</b>, FILION Luc, FONTAINE S&eacute;bastien. "Codesign Experiences Based on a Virtual Platform," in <a href="http://www.amazon.ca/exec/obidos/ASIN/1441909648/leblogdepolys-20"><u>ESL Models and their Application: Electronic System Level Design and Verification in Practice</u></a>, BAILEY Brian et MARTIN Grant &Eacute;ds. New York, NY: Springer, 2010, pp. 273-308.
<p>BOIS Guy, <b>MOSS Laurent</b>, ABOULHAMID Mostapha. <u>Exploration, Design and Development of Hardware &amp; Software Multi-Processor Embedded Systems Made Easier</u>. 9th International Forum on Embedded MPSoC and Multicore (MPSoC&apos;09), ao&ucirc;t 2009.
<p><b>MOSS Laurent</b>, BOIS Guy. <a href="http://www.polymtl.ca/biblio/epmrt/rapports/rt2009-01.pdf"><u>On the Scott-continuity of tagged signal processes</u></a>. Rapport technique EPM-RT-2009-01, &Eacute;cole Polytechnique de Montr&eacute;al, avril 2009, 29 p.</p>
<p><b>MOSS Laurent</b>, CANTIN Marc-Andr&eacute;, BOIS Guy, ABOULHAMID Mostapha. <a href="http://dx.doi.org/10.1109/RSP.2008.17"><u>Automation of Communication Refinement and Hardware Synthesis within a System-Level Design Methodology</u></a>. 19th IEEE/IFIP International Symposium on Rapid System Prototyping (RSP&apos;08), juin 2008, pp. 75-81.</p>
<p><b>MOSS Laurent</b>, DE NANCLAS Maxime, FILION Luc, FONTAINE S&eacute;bastien, BOIS Guy, ABOULHAMID Mostapha. <a href="http://www.date-conference.com/archive/conference/proceedings/PAPERS/2007/DATE07/PDFFILES/06.4_2.PDF"><u>Seamless Hardware/Software Performance Co-Monitoring in a Codesign Simulation Environment with RTOS Support</u></a>. 10th Design, Automation and Test in Europe Conference and Exhibition (DATE&apos;07), avril 2007, pp. 876-881. (Taux d&apos;acceptation: 22%; 208/933)</p>
<p>FILION Luc, CANTIN Marc-Andr&eacute;, <b>MOSS Laurent</b>, ABOULHAMID Mostapha, BOIS Guy. <a href="SpaceCodesign_DVCON07.pdf"><u>Space Codesign : A SystemC Framework for Fast Exploration of Hardware/Software Systems</u></a>. Proceedings of the Design &amp; Verification Conference and Exhibition (DVCON&rsquo;07), f&eacute;vrier 2007, 8 p.
<p><b>MOSS Laurent</b>, FILION Luc, FONTAINE S&eacute;bastien, CANTIN Marc-Andr&eacute;, BOIS Guy, ABOULHAMID Mostapha. <u>Seamless Hardware/Software Performance Co-Monitoring with Space Codesign</u>. Symposium annuel de CMC Microsyst&egrave;mes, Exposition TEXPO. Ottawa, octobre 2006. Poster de kiosque universitaire.</p>
<p>CHEVALIER J&eacute;r&ocirc;me, FILION Luc, DE NANCLAS Maxime, SAMSON Patrick, FAIZ Ahmed, <b>MOSS Laurent</b>, BOIS Guy, ABOULHAMID Mostapha. <u>Space Codesign Designing SoC/FPGA at High-Level</u>.  Design, Automation and Test in Europe Conference and Exhibition (DATE&apos;06). Munich, Allemagne, mars 2006.  Poster de kiosque universitaire.</p>
<p><b>MOSS Laurent</b>. <u>Configuration, d&eacute;veloppement d&apos;applications, comparaison et port du RTOS TimeSys Linux</u>.  Rapport de projet de fin d&apos;&eacute;tudes soumis comme condition partielle &agrave; l&apos;obtention du dipl&ocirc;me de baccalaur&eacute;at en ing&eacute;nierie. Montr&eacute;al : &Eacute;cole Polytechnique de Montr&eacute;al, 2005, 77 p.</p>
</td></tr>
<tr>
<th>Autres informations</th>
</tr>

<tr><td>
<ul>
<li>Charg&eacute; de laboratoire du cours <a href="http://www.polymtl.ca/etudes/cours/details.php?sigle=INF8500" target="_blank">INF8500: Syst&egrave;mes embarqu&eacute;s: conception et v&eacute;rification</a> pour les sessions d&apos;automne 2008 et d&apos;automne 2009</li>
<li>Secr&eacute;taire de <a href="http://www.coopoly.ca/" target="_blank">Coopoly</a> pour 2008-2009</li>
<li>Membre du Conseil d&apos;administration de <a href="http://www.coopoly.ca/" target="_blank">Coopoly</a> pour 2007-2010</li>
<li>Secr&eacute;taire-tr&eacute;sorier de <a href="http://www.aecsp.qc.ca/" target="_blank">l&apos;Association des &eacute;tudiants des cycles sup&eacute;rieurs de Polytechnique</a> pour 2007-2008</li>
<li>Membre du Conseil d&apos;administration de <a href="http://www.aecsp.qc.ca/" target="_blank">l&apos;Association des &eacute;tudiants des cycles sup&eacute;rieurs de Polytechnique</a> pour 2006-2009</li>
<li>Charg&eacute; de laboratoire du cours INF6501: Sp&eacute;cification et conception des syst&egrave;mes embarqu&eacute;s pour la session d&apos;hiver 2007</li>
<li>Charg&eacute; de laboratoire du cours <a href="http://www.polymtl.ca/etudes/cours/details.php?sigle=INF1500" target="_blank">INF1500: Logique des syst&egrave;mes num&eacute;riques</a> pour les sessions d&apos;automne 2005 et d&apos;hiver 2006</li>
<li>Supervision de la r&eacute;alisation du projet de fin d&apos;&eacute;tudes Design et Programmation C++ orient&eacute; objet du syst&egrave;me de monitoring des transactions de la plateforme SPACE lors de la session d&apos;hiver 2006</li>
<li>Laur&eacute;at du <a href="http://www.polymtl.ca/carrefour/article.php?no=2057" target="_blank">2e Prix universitaire du M&eacute;rite 2005</a> de l&apos;Ordre des ing&eacute;nieurs du Qu&eacute;bec</li>
<li>Membre de <a href="http://www.oiq.qc.ca/" target="_blank">l&apos;Ordre des ing&eacute;nieurs du Qu&eacute;bec</a>, de l&apos;<a href="http://www.ieee.org/" target="_blank">Institute of Electrical and Electronics Engineers</a> et de l&apos;<a href="http://www.acm.org/">Association for Computing Machinery</a>.</li> 
<li><a href="http://www.fqechecs.qc.ca/cms/cotes/membres/id/66240" target="_blank">Expert de la F&eacute;d&eacute;ration qu&eacute;b&eacute;coise des &eacute;checs</a> depuis 2000</li>
</ul>
</td></tr>
</table>

<!-- Start of StatCounter Code -->
<script type="text/javascript" language="javascript">
var sc_project=1678622; 
var sc_invisible=1; 
var sc_partition=16; 
var sc_security="0a432043"; 
</script>

<script type="text/javascript" language="javascript" src="http://www.statcounter.com/counter/counter.js"></script><noscript><a href="http://www.statcounter.com/" target="_blank"><img  src="http://c17.statcounter.com/counter.php?sc_project=1678622&amp;java=0&amp;security=0a432043&amp;invisible=1" alt="website stat" border="0"></a> </noscript>
<!-- End of StatCounter Code -->
</body>
</html>